{"description": "THE BLIND OWL BAND'S HALLOWEEN BASH & ALBUM RELEASE\nWith Special Guests: The Honey Smugglers and Folkfaces\n\nTickets here 👉 www.ticketfly.com/purchase/event/1558202?\nAnthology, Rochester, NY \nSATURDAY:  October 28th, 2017\nDOORS:  7:30pm  (18+) Tickets $15 in advance\n\nCostume Party!!!  Blind Owl Band's 3rd Album Release!\n\n\nThe Blind Owl Band - Saranac Lake, NY \nwww.theblindowlband.com\n\"Adirondack Freight Train String Music\"\n\nHailing from Saranac Lake, NY, in the heart of the Adirondack mountains, The Blind Owl Band has been creating what they call Freight Train String Music since 2010. And a freight train it truly is. Although the quartet's sound is rooted in traditional stringed instruments (guitar, basses, banjo and mandolin), their music surges forward with the strength and power of a hundred-ton diesel locomotive. Songs barrel down the tracks with momentum and intensity normally found in much heavier, heavily amplified music. “Although we look like a bluegrass band we are not,\" explains co-founder Eric Munley (mandolin, vocals). \"Collectively, we're a musical representation of the sounds floating around in our heads. We use the instruments of our ancestors, but play music of our time; we're influenced much more by all that has happened in the musical world over the past three decades than by what was created in the first three-quarters of the 20th Century.\" The Blind Owl Band builds on what they regard as a basic approach to traditional songwriting and arranging and push the envelope, stretching the limits of raw, acoustic instrumentation. Munley explains part of the band's mindset: \"In a time of perfection and an increasing reliance on digital processors, we're trying to expand the sound, to inspire use of wood and metal.\" In just under five years the band has released two albums (Rabble Rousing and This Train We Ride is Made of Wood and Steel) and toured extensively throughout the eastern US, logging nearly 600 show across 17 states since January 2012. They've played on almost every festival east of the Mississippi and shared the stage with countless artists across all genres of the musical spectrum. Looking ahead into 2017, the band will begin recording their as-yet-untitled third full length album in early summer, with an eye toward a October 13th, 2017 release. This freight train has no one conductor but four shovel boys pushing the limits of their engine night after night, so climb aboard and get ready for a one-of-a-kind ride.\n\nThe Honey Smuggles - Rochester, NY \nJamGrass / Alt-Folk / Americana / Country-Rock / Foot-Stompin' / Heart-Wrenchin' / Good-Timin' / Fun / Costume Champs \nwww.honeysmugglers.net\n\n\nFolkfaces- Buffalo, NY \nFolk, Jazz, Blues, Punk, Ragtime, Americana, Alt-Gypsy\nhttps://folkfaces.bandcamp.com/\n\nBio:\nFolkfaces is a group out of Buffalo, NY that plays a rowdy blend of rootsy Folk, Jazz, and Blues - fusing classic forms with contemporary feelings and irresistibly danceable energy. Their inspiration comes from the mountains of Appalachia to the deltas of Mississippi, the swamps of Louisiana to the Concrete Jungle of the Rustbelt. Specializing in merriment and sticking it to the system, Folkfaces make the crowd dance and the hierarchy shatter.", "start_time": "2017-10-28T19:30:00-0400", "place": {"id": "588990331247531", "name": "ANTHOLOGY", "location": {"city": "Rochester", "zip": "14604", "country": "United States", "longitude": -77.59533, "state": "NY", "street": "336 East Ave.", "latitude": 43.15543}}, "end_time": "2017-10-29T02:00:00-0400", "id": "1197266347044134", "name": "The Blind Owl Band's Halloween Bash/ Honey Smugglers & Folkfaces"}