{"description": "Jimkata\nw/ Ocular Panther\nFlour City Station\nThursday 10.19\n8pm door\n9 PM start\n $12 advance\n $15 at door\n21+\n\nMarking an end of an era, Jimkata celebrates their journey by kicking off their Farewell Tour at Flour City Station on Thursday October 19th before heading onto an indefinie hiatus. Ocular Panther will start the night off.\n\nJIMKATA\n\nTake note: Jimkata is not a cool electronic rock band.\n\nI mean, they are. The band’s new album, In Motion, is a triumph of swirling analog synths and breezy pop hooks. It’ll make your body groove.\n\nBut dig deeper. You’ll be rewarded with something more...personal. \n\n“There’s a lot of great music out there that makes you move, but you don’t remember it afterwards,” says Jimkata frontman Evan Friedell. “We’re OK with embracing our emotional side. I think we have a little bit of soul. We’re embracing all the things that make classic songs.”\n\nThis added emotional gravitas is borne partially out of trust. Friends since middle school, Friedell, Aaron Gorsch and Packy Lunn infuse Jimkata — which, yes, is named after the so-bad-it’s-good 1985 gym-fu caper Gymkata—with both an adventurous musical streak and an emotional core. \n\n“I was drawn to music in two ways,” says Friedell. “One was through the backbeat—I grew up with Michael Jackson and Paul Simon’s Graceland. Everything was rhythmically accentuated. But the second avenue is good songwriting. Something that hits the body and the heart.”\n\nWhich means, mixed in with the modern synth sensibilities (you’ll certainly hear echoes of LCD Soundsystem on album closer “Synapses”) and progressive rock tropes are influences drawn from the likes of Motown, singer-songwriters like James Taylor and even old country songs, where storytelling and a quick turn of phrase share priorities with melody and the beat. \n\nIt’s an unusually rich and rewarding mix, and one that’s evolved naturally. Over the past half-decade, the Ithaca-based band has operated without a record label, publicist or support system of any kind. “We just road dogged it,” says Friedell. “It’s all DIY. Doing 150 shows a year, sleeping on floors, recording songs along the way. We built everything organically, all word of mouth. The advice we got when we started was ‘Just go out and play. It’ll pay off.’”\n\nIn Motion marks the band’s second fan-funded record through PledgeMusic. Gorsch’s love of unusual rhythms and vintage synths fuel the album’s first half, highlighted by the pop earworm “Wild Ride” and the melancholia of “Jumping Out of Airplanes.” Halfway through, the album shifts to a more progressive, guitar-based affair, led by the percussive funk of “Innocence.” It’s an adventurous album, one that could find a home equally amongst fans of Yeasayer, LCD Soundsystem or Tom Petty. \n\nBesides a musical shift, In Motion marks some other important changes. The group recently transitioned to three members from four. As well, the trio was forced off the road for an extended period of time, which ended up—unexpectedly—helping evolve their music.\n\n“This is the first time we’ve been off from touring for a while,” says Friedell. “We were sort of living like gypsies or nomads, living the road life. We’ve never had this much time to work on an album and just live with the songs. It’s been a creative, reflective time for us.”\n\nLyrically, In Motion doesn’t center on any one theme. “I sort of discover what I’m writing about later,” says the singer. “And I don’t always know where the inspiration comes from. But overall, these are songs about processing adversity.”\n\n(Themes that certainly resonate with the band’s fans. “We’ve had people tattoo our lyrics on their arms. That was a revelation to me—we’re doing something right.”)\n\nFortunately for long-time fans, the band plans to hit the road again early next year. “We’re pretty high-energy on stage,” says Friedell. “We tour with a light show and improvise a lot. We’ve toured so much, and experienced every scenario, good or bad. So we know how to play live and create some energy.”\n\nAnd for Jimkata, it’s about finding the right energy—that balance between heart and mind.\n\nSays Friedell: “Ideally, we’re writing songs where someone says, ‘I know that feeling. That song picks me up. It has real meaning to me.’”\n\nOCULAR PANTHER\n\n\"Ocular Panther is bold; a brash and brilliant example of ethereal pursuit with organic tools. They have melded music from different genres, eras, and approaches to create a new contagion of danceable ambiance and rock grit. Some of the songs exhibit a protracted intro to their varied grooves that grow from a standard hook into a kind of epiphany. It smacks smooth and gloriously disjointed.\"\n\n -Frank De Blasé, Rochester City Newspaper\n\n \"Ocular Panther’s sound doesn’t so much caress and cajole the listener as it stalks that listener like prey through a jungle that sounds like it erupted from the mind of Salvador Dali. Essentially dance music, the band’s sound employs electro grooves as if they were the obvious basis for a brand of outer-space funk. The music is sinewy and menacing. A blend of world beat, European electro, and a futuristic marriage of both laid the basis for the virtuosic interplay of the musicians, who managed to take what was essentially dance music into some deeply interesting places. Ocular Panther seems to have no trouble crafting music that moves with purpose and forward motion, avoiding the pitfalls of lazy static repetition. Which is to say, this is music that you can dance to, analyze, or simply lose yourself within with equal ease.\"\n\n -Jeff Miers, The Buffalo News\n\nwww.ocularpanther.com", "start_time": "2017-10-19T20:00:00-0400", "place": {"id": "622059694538938", "name": "Flour City Station", "location": {"city": "Rochester", "zip": "14604", "country": "United States", "longitude": -77.59971, "state": "NY", "street": "170 East Ave", "latitude": 43.15669}}, "end_time": "2017-10-20T00:00:00-0400", "id": "1611016295635160", "name": "Jimkata Farewell Tour w/Ocular Panther Flour City Station"}