{"description": "It never fails: our Halloween Party is on of the CRAZIEST, BUSIEST NITES OF THE YEAR! This year we went all out and brought in two of our favorite bands: Mister F + Mosaic Foundation! This will be the first time either band gets to rock our DOWNSTAIRS CONCERT COMPLEX! Break out those costumes and get ready to dance your butts off and eat tons of candy! AFTER PARTY in UPSTAIRS LOUNGE w/ Dj Dale C! \n\nMEMBERS & GUESTS! MEMBERSHIPS AVAILABLE FOR PURCHASE w/ MEMBER SPONSOR! AGES 21 & UP! NO ADMITTANCE AFTER 2AM! PARKING ON STREET, BEHIND WEBER ELECTRIC, & ACROSS STREET IN EmergyCare LOT! DO NOT BOCK GARAGE DOORS & AMBULANCE EXITS!\n\nKRC BUS STOP BISTRO OPEN 9-2:30 serving pizza, tacos, loaded hotdogs & MORE! TAKEOUT AVAILABLE!\nFREE POOL, SHUFFLEBOARD & GAMES ALWAYS! \n_____________________________________________________________________\n\nFormed in 2013 from members of Northeast regional acts Timbre Coup and Capital Zen, Mister F are an eclectic, high-energy 4-piece band that takes a no-holds-barred approach to blending genres while keeping your feet moving. Describing their sound as “neat and clean, hard and dangerous”, Mister F‘s calculated yet danceable fusion-fueled sound provides something for both musicians and listeners alike. Having performed at festivals such as The Hudson Project, Catskill Chill, Disc Jam and Resonance, and with their previous bands at Mountain Jam, moe.down, Summer Camp, Camp Bisco, and snoe.down, the members of Mister F are no strangers to the music community. Their first show on March 1, 2013 was very well-received, and they quickly took their show on the road, reaching cities as far as Telluride, CO and Atlanta, GA within just a few short years.\n\n“Mister F...a dynamic quartet that broaches all aspects of organized music. Rooted in funk traditions, Mister F's members are no strangers to unique compositions and sonic explorations, though it's done with a tightness that keeps listeners dancing throughout their performances.”\n-Live For Live Music\n_____________________________________________________________________\n\nWith a style as unique as its members are diverse, Mosaic Foundation is forward thinking reggae that stays true to the roots. Formed in 2009 and based in the Finger Lakes region of New York, the band has grown a loyal following, thanks to electric live performances and three studio releases. Blending roots, ska, dub, dance-hall and beyond, Mosaic is an exploration in reggae that is pushed to the limits and sometimes spills over. With lyrics that inspire dancing in the moment, and activate the mind in reflection, the songs encourage positivity, sustainable living and community.", "start_time": "2017-10-28T21:00:00-0400", "priority": "0", "place": {"id": "121110381239535", "name": "Kings Rook Club", "location": {"city": "Erie", "zip": "16502-2814", "country": "United States", "longitude": -80.0781, "state": "PA", "street": "1921 Peach St - PO Box 453", "latitude": 42.11662}}, "end_time": "2017-10-29T02:00:00-0400", "id": "110965899586091", "name": "KRC Halloween BASH w/ Mister F & Mosaic Foundation! OCT 28!"}