{"description": "Gang of Thieves will make you believe in Rock n' Roll again. \n\nHigh energy and an unforgettable live performance is the hallmark of these Vermont funk rockers who bring forth a new breed of rock and roll to create a powerful sound palatable to audiences of all ages. The key to the Gang’s universal appeal is their infectious sense of fun and showmanship delivered with a message that inspires and encourages positivity, making them a popular choice from rock venues to jam festivals, college to pre-schools. Featuring an electric violin tastefully woven into solid rock grooves, the Gang blends a variety of genres into memorable tunes that beg listeners to sing or dance along.\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nE.N Young born Ian Allan Young, is a roots musician born and raised on the USA/Mexico border in San Diego, California. E.N started playing piano at age 6, which was the beginning of his musical life. His parents bought him a white upright Samick Piano that he still records and plays on today. At age 12, he broke his left arm and the doctor recommended some physical activity to help recover. In response, his father bought him a drum set to help with his recovery. Not only did it help physically but E.N found a passion for percussion and drums. With his new drumming talent, he reinvented himself on the piano and his musical world was revealed. \n\nReggae music has always been a part of E.N Young's life. Growing up with his brothers, Manuel and Mike'Chunky Roots' Marquez, reggae was around and the influence was strong. Daily, E.N and his brothers would search for the next reggae tune that caught their ears and lose themselves within the reggae vibes. Now, E.N is more involved in the reggae scene than ever imagined. Not only has he established a name for himself as an individual artist but also as a writer and producer.\n\nE.N started performing when he was 15 years old and in 2002 he became a member of the band Stranger. As a band they put out four studio albums and toured on the West coast, including Guam and Hawaii; which led them to win the San Diego Music Award in 2009. In 2005, E.N Young met Bonita/Chula Vista locals, Roots Covenant. They played the strongest and most authentic roots reggae sound on the West coast and backed 30+ Jamaican artists. In 2010 E.N began pushing his solo career by releasing his first debut album ‘Luck & Chance No More’ under his new label, Roots Musician Records; he became the first artist under RMR and began to tour as a solo artist. Along his musical path, he has played onstage with many influential reggae artists including Quino Big Mountain, Devastators, Johnny Clarke, Triston Palma, Sammy Dread, Heptones, Everton Blender, Jah Batta, Michael Palma, Sister Nancy, Edi Fitzroy, Anuhea, Tamarama, Stranger, Carlton Livingston, Don Carlos, Slightly Stoopid, the Abyssinians, Clear Conscience, Eek A Mouse, English Man, Gonzo, Tribal Seeds, Milton Henry and more.\n\nIn May 2011, E.N went into studio with Tribal Seeds to produce their new EP ‘SoundWaves.’ The EP was released in July and received world-wide attention. From Hawaii to New York, E.N Young completed a fall national tour as the opening artist for Tribal Seeds. A year after that E.N officially joined Tribal Seeds,playing keyboard, melodica and singing.\n\nConstruction of E.N’s studio, Imperial Sound Recording Studio took place in August of 2012 and was completed in January of 2013. Imperial Sound is the most southwest recording studio in the United States; bordering Mexico and the Pacific Ocean. It was a dream that has manifested into a professional recording studio. The doors to Imperial Sound were officially opened on January 2, 2013. As soon as the studio was ready bands began to come through the studio to record some great records. Some of those bands include: Tribal Seeds, High Tide, HIRIE, K Bong, Beyond I Sight, Gonzo, Inna Vision, Clear Conscience and Without Papers. Imperial Sound Recording Studio is located near the Imperial Beach in sunny San Diego, California.\n\nE.N Young is continuing to make sweet reggae music in his studio producing tracks for several bands and Roots Musician Records signed artists, including Gonzo, Leilani Wolfgramm, Tatanka, Mystic Roots Band, Clear Conscience, Revival, Animo, Inna Vision and Skanks Roots projects. He released his sophomore album ‘Live, Love, Stay Up’ in January of 2015 which consisted of 27 tracks including acoustic and dub versions. The album featured Tribal Seeds, Maad T-Ray (Of Tribal Seeds), Kali Navales and Jah Gumby (of Ooklah The Moc) and Gonzo. E.N recently released his newest album ‘Call On Me’ in April 2016 with it debuting at #3 on Itunes reggae charts. To E.N Young, ‘Call On Me’ is his most artistic and free album so far and he believes it will be a bridge for new reggae listeners as well as a continuing foundation for roots lovers. E.N Young's main goal continues to be, to travel the world spreading good through music and inspiring others.", "start_time": "2017-11-02T20:00:00-0400", "priority": "0", "place": {"id": "622059694538938", "name": "Flour City Station", "location": {"city": "Rochester", "zip": "14604", "country": "United States", "longitude": -77.59971, "state": "NY", "street": "170 East Ave", "latitude": 43.15669}}, "end_time": "2017-11-03T02:00:00-0400", "id": "123148408339036", "name": "Gang of Thieves w/s/g/ E.N Young at Flour City Station"}