{"description": "DSP Shows Presents Richie and Rosie's Album Release Show with Special Guest Lady D at The Haunt on 11/24! \n\n7:00PM Doors\n8:00PM Show\n\nRichie and Rosie\nhttp://richieandrosie.com/\nRichie Stearns and Rosie Newton grew up 150 miles and a few decades apart. Having originally met at Saratoga Springs’ Flurry festival, the two reunited in the Ithaca old-time scene, where Richie grew up and Rosie had moved for college. During Rosie’s freshman year, they began touring together regionally as members of the Evil City String Band and eventually decided to pursue a more intimate project as a duo. In 2013 the duo released their first album, Tractor Beam, a 12-track mix of originals and classics, designed to mirror the experience of a live performance.\n \nAfter three years of touring and writing, Richie and Rosie returned to the studio last December to record their second full-length album, Nowhere in Time. Set for release November 10, 2017, the record finds itself at a junction of Americana, old-time, and folk, bringing a new sound to traditional music. Recorded with producer Alex Perialas at Pyramid Sound Studios, the project gives fans a look inside the band’s personal lives with a variety of introspective lyrics. With singles like, “Honey Bee”, “No Longer Lonely”, and title-track, “Nowhere in Time,” the album highlights the incredibly-refined skill of both musicians. \n            \n            Before joining forces, both members were well-established within the old-time community. Rosie has toured with multiple bands, including an appearance while she was in high school with folk-rock band The Mammals. In 2010, she released a self-titled album as part of the duo The Pearly Snaps. In addition to releasing two solo albums, Richie’s discography includes collaborations with Natalie Merchant, Jim Lauderdale, Donna the Buffalo, and Carrie Rodriguez. He has performed internationally with bands like Bela Fleck, Pete Seeger, David Byrne, Billy Bragg & Wilco, Old Crow Medicine Show, and Joan Baez. He is the President of the iconic GrassRoots Festival of Music & Dance.\n \nWith the fated combination of Richie and Rosie’s unique skill, varied musical influence, and honest storytelling, Nowhere in Time defines exactly what the duo hopes to achieve -- music that people can connect with. As two musicians in two very different parts of life, Richie and Rosie are proof of two things: the power and magic of two people making music, and that the universal messages that lie within their songs remain timeless.", "start_time": "2017-11-24T20:00:00-0500", "priority": "9", "place": {"id": "124752354274305", "name": "The Haunt", "location": {"city": "Ithaca", "zip": "14850", "country": "United States", "longitude": -76.50517, "state": "NY", "street": "702 Willow Ave", "latitude": 42.45146}}, "id": "130865814218755", "name": "Richie and Rosie's Album Release Show"}