{"description": "UPDATE:\n\nALL FOUR SHOWS ARE NOW SOLD OUT\n\nTHANK YOU VERY MUCH FOR ALL YOUR SUPPORT!!!\n\nLovin’ Cup Bistro & Brews is proud to present “The Music of Emmet Otter’s Jug-Band Christmas (and other Jim Henson favorites)”. Each year, an all-star lineup from several of Rochester’s favorite bands come together to pay homage to this beloved classic with an interactive performance of all its music along with audio and visual samples from the film, along with other classic Muppet songs as well. If you share our love of the magical world of Jim Henson and the wonderful music that came from it- or even if you’re a newcomer and just want to know why so many have come to adore it- we invite you to come see the show!\n\nFeaturing members of Maybird, The Moho Collective, The Honey Smugglers, The Niche, Pleistocene, The Ruckus Juice Jug Stompers, The Isotopes and more!\n\nFOUR SHOWS TO CHOOSE FROM...\n\nFRIDAY, DECEMBER 1ST | 8PM\nhttps://www.ticketweb.com/t3/sale/SaleEventDetail?dispatch=loadSelectionData&eventId=7841585\n\nSATURDAY, DECEMBER 2ND | 4PM\nhttps://www.ticketweb.com/t3/sale/SaleEventDetail?eventId=7852615&pl=lovincup&dispatch=loadSelectionData\n\nSATURDAY, DECEMBER 2ND | 8PM\nhttps://www.ticketweb.com/t3/sale/SaleEventDetail?dispatch=loadSelectionData&eventId=7841595\n\nSUNDAY, DECEMBER 3RD | 2PM\nhttps://www.ticketweb.com/t3/sale/SaleEventDetail?dispatch=loadSelectionData&eventId=7841605\n\nAbout “Emmet Otter’s Jug-Band Christmas”…\n\nIn 1977, Muppet creator Jim Henson produced a one-hour television adaptation of Emmet Otter's Jug-Band Christmas, a storybook by Russell Hoban. The story tells of Emmet Otter and his Ma, a widow who scrapes by on the small amount of money she gets from doing laundry and from Emmet doing odd jobs around their hometown of Frogtown Hollow. As Christmas approaches, they hear of a talent contest in the nearby town of Waterville, and separately decide to enter so that if they win, they can afford to buy nice presents for each other—a nice guitar for Emmet, or a piano for Ma. However, in a twist on “The Gift of the Magi”, they must sacrifice each other's livelihood for their performances (Ma hocks Emmet's tools to buy dress fabric while Emmet turns Ma's washtub into a washtub bass for a jug band). The film features several amazing songs written by songwriter Paul Williams, who’d previously worked with Jim Henson on The Muppet Show and would go on to write all the songs for The Muppet Movie and The Muppet Christmas Carol; however, many fans agree that the music of Emmet Otter’s Jug-Band Christmas was the best work of his career.\n\nALL SHOWS / $10 ADVANCE / $15 DAY OF SHOW / $5 KIDS 10 & UNDER", "start_time": "2017-12-01T20:00:00-0500", "priority": "9", "place": {"id": "143806965652986", "name": "Lovin' Cup", "location": {"city": "Rochester", "zip": "14623", "country": "United States", "longitude": -77.656892912435, "state": "NY", "street": "300 Park Point Drive", "latitude": 43.0917479}}, "end_time": "2017-12-03T15:30:00-0500", "event_times": [{"start_time": "2017-12-01T20:00:00-0500", "id": "1463935493725344", "end_time": "2017-12-01T21:30:00-0500"}, {"start_time": "2017-12-03T14:00:00-0500", "id": "1463935490392011", "end_time": "2017-12-03T15:30:00-0500"}, {"start_time": "2017-12-02T20:00:00-0500", "id": "1463935487058678", "end_time": "2017-12-02T21:30:00-0500"}], "id": "1463935480392012", "name": "The Music of Emmet Otter's Jug-Band Christmas and more"}