{"description": "$5 and just tell the kind man at the door if you couldn't scrounge it.  \nOne more for the books.  Coming full circle back to Abilene where it all began for what seems like might be the final Medicine Wednesday of all time.  Roger Kuhn joins us again as he always has.  We have had some really good times.  Remember the backyard nights?  It would still be light out for the first sets before darkness and night air and togetherness would send the second sets out to the stars.  Remember?  Moon is a Lady under the moon in front of that beautiful magnolia (which bloomed twice one year) where that one summer Rachel was pregnant and we did Wednesdays up to the due date.  That time we did thanksgiving eve out back just after (we weren't sure yet) the boy was conceived.  Remember those greasy back stairs at DubLand?  Remember when Natalie was on the way and Dennis Mariano gave us a two week warning so Sam Snyder joined the band?  Remember when Sam got signed and took his turn to quit but then filled in for Dennis the next eight shows in the Flour City Station era?  Remember all those far away places we went that were never as special as those nights in the yard at Abilene?  All the miles were worth it if for no other reason than amazing times with brothers and sisters.  Sisters, plural?  Yeah.  Remember after Jasper came and we had to bring a sitter on the road?  There mighta been a few at first, but then there was Ellie Mancine.  Song goes on and on like the moon like sun.   And we'd get to play music in between the drives and endless jokes.  We sure do get along well.  It was at Abilene that we agreed to play a private (it wasn't) wedding celebration for our dear friend Julia Nitzsche . pour out some sticpimpoli for the ancestors.  Dennis was (is) the patriarch.  He had invited Brian Blatt (who stayed foreverish) and told me (Matt) to set up the drums front and center (which seemed odd but became our permanent style).  Abilene.  That's all I'm saying.  Memories and one more chance to make some.  May the bucket overflow if it didn't a long time ago.  This is where we put the glazed pot back in the kiln for a final firing.  Then we have 3 shows 3 nights in a row at the end of December then ..... pooooof.... Onward!", "start_time": "2017-11-29T20:00:00-0500", "priority": "9", "place": {"id": "189238104475924", "name": "Abilene Bar and Lounge", "location": {"city": "Rochester", "zip": "14604", "country": "United States", "longitude": -77.604294, "state": "NY", "street": "153 Liberty Pole Way", "latitude": 43.160099}}, "id": "1484128381623527", "name": "Medicine Wednesdays Forever"}