{"description": "$10 Adv/$13 Dos / Age 18 And Up\n\nAdditional Info:\nThe Last Revel: From the budding music scene of the Upper Midwest comes the cutting edge Front Porch Americana soundscapes of The Last Revel. This powerfully talented trio of multi-instrumentalists from Minneapolis, Minnesota so naturally blends the genres of Folk, Rockabilly, Old Time String-Band and Rock to create a sound that is as equally original as it is timeless. The Last Revel trio utilizes their multi-instrumental abilities to bring the acoustic guitar, upright bass, fiddle, 5-string banjo, harmonica, kick drum and three-part vocal harmonies together to consistently deliver \"Bombastic live performances,\" as well as delicate and haunting folk ballads.With their second, self titled, album released in May of 2015, The Last Revel further demonstrates their ability to create rich and delicately textured recorded material with a modern \"tip of the hat\" to the storied history of American folk music.Slocan Ramblers: The Slocan Ramblers are Canada's young bluegrass band to watch. Rooted in tradition, fearlessly creative and possessing a bold, dynamic sound, The Slocans have quickly become a leading light of Canada's roots music scene. With a reputation for energetic live shows, impeccable musicianship and an uncanny ability to convert anyone within earshot into a lifelong fan, The Slocans understand that if you polish up the music, you lose the raw excitement that makes it so vibrant.On their sophomore album Coffee Creek (2015), The Slocan Ramblers blend lightning fast and devilishly intricate instrumentals with sawdust-thick vocals. In the liner notes, producer Chris Coole breaks it down: \"What really impressed me while we were working on this album, was that, while they can pull off the precision and virtuosity that is at the backbone of bluegrass, they understand the power of the fragile moment in music.\" On Coffee Creek, they've done this by staying true to the rough and rowdy roots of the music.\"I love it - smokin' bluegrass!\" - BBC RadioEdmonton Folk Fest Emerging Artist Award - 2015 Recipient\nTickets:\nhttp://www.ticketweb.com/event/the-last-revel-and-slocan-funk-n-waffles-music-hall-tickets/7873445?REFERRAL_ID=twfb", "start_time": "2018-01-05T21:00:00-0500", "priority": "9", "place": {"id": "86659589746", "name": "Funk 'n Waffles Rochester", "location": {"city": "Rochester", "zip": "14604", "country": "United States", "longitude": -77.61141, "state": "NY", "street": "204 N Water St", "latitude": 43.16048}}, "id": "1505862476177021", "name": "The Last Revel And Slocan Ramblers"}