{"description": "18+\n$8 at the door\nDoors 8PM / Show 9PM\n\nwww.dubbestmusic.com\n\nSince 2009, Dubbest has been forging its own path through the heavily forested reggae landscape, expertly infusing roots traditionalism with a refreshing improvisational savvy that calls to mind not only the studio experimentation of pioneering dub producers Osbourne “King Tubby” Ruddock and Lee “Scratch” Perry but also the real-time exploration of jam bands like the Grateful Dead and Phish. As friends in high school, guitarist Andrew MacKenzie, singer/keyboardist Ryan Thaxter, bassist Sean Craffey, guitarist Cory Mahoney, and drummer Kyle Hancock shared a love of pop-punk and ska, bonding over bands like Black Flag, until they caught wind of Augustus Pablo’s 1974 dub classic Ital Dub. This was the gamechanger that set the stage for their current musical approach: using introspective, spacious bass and drum grooves to anchor a thickly-textured interplay of instruments, vocals, and timbres. With their third album, Light Flashes, Dubbest is poised for national recognition.\n\nPolished to perfection over a three-year period, Light Flashes invokes the spark of inspiration the band felt working with veteran producer Craig “Dubfader” Welsch of 10 Ft. Ganja Plant over at Rear Window Studios in Brookline, MA. As Andrew MacKenzie notes, “It is a powerful name to us, and it tends to catch one’s attention, like an actual flashing light. It’s a great fit for this album. The name and the artwork together help bring out the album’s edge.” They credit Welsch with taking their music to a higher level of musicianship and authenticity, noting how he draws out the best from each band member and employs a large stock of vintage instruments, such as a Hammond B3 organ and 1950s Fender Stratocasters, to convincingly evoke the 1970s glory days of roots reggae and dub. Kevin Metcalfe’s mastering work cemented this old-school sound: he has provided the finishing touch on albums by U.K.’s pop, rock, and reggae luminaries since the 1960s. On the musician front, the band was aided by stalwarts of the Boston scene, including Elliot Martin of John Brown’s Body on backing vocals and 10 Ft. Ganja Plant’s Mark Berney, Jared Sims, and Brian Thomas on horns and Steve D on synthesizer.", "start_time": "2017-11-14T21:00:00-0500", "priority": "9", "place": {"id": "1392746251051226", "name": "Casita Del Polaris", "location": {"city": "Ithaca", "zip": "14850", "country": "United States", "longitude": -76.4975281, "state": "NY", "street": "1201 N Tioga St Unit 2", "latitude": 42.4533195}}, "id": "1522010691221041", "name": "Dubbest w/ Matthew O’Brian of Thunder Body"}