{"description": "DSP Shows Presents\nGiant Panda Guerilla Dub Squad w/ guest Aaron Lipp & The Slack Tones at The Haunt Friday, December 1!\n\nDoors: 7 PM / Show: 8 PM\n18+ (Under 18 admitted with Parent or Legal Guardian)\nTickets: http://ticketf.ly/2wVSUoz\n\nGiant Panda Guerilla Dub Squad\nhttp://livepanda.com/\n\nGiant Panda Guerilla Dub Squad’s sixth studio album MAKE IT BETTER was released September 16, 2016 on Rootfire Cooperative. It debuted at #1 on the Billboard Reggae Chart.\n \nFormed in 2001 in Rochester, New York, GPGDS first received praise for their live show, which combined world beats and reggae rhythms within jamband aesthetics. In recent years the band’s studio recordings, which showcase their songwriting and musicianship across all genres of roots music, have further cemented their legend as master innovators and artists. “There is a lot of intention in this release. We had a purpose to prove to ourselves recording this album [MAKE IT BETTER]. We wanted to know that we could put our heads down and do good work fast. It was a great release artistically. It uniquely sounds the most progressive of anything we have ever done while also sounding the most like our first album.” -James Searl, Bassist/Vocalist\n\nAaron Lipp & The Slack Tones\nhttps://aaronlipp.com\nWhile wielding sweet-toned electric guitar, groove hungry upright bass slapping, rock solid drumming and a screaming fiddle, the Slack Tones will help you find yourself in a 1950's rockabilly club mixed with dead-on bluegrass flatpicking and new original songwriting. With their new record featuring Oliver Wood of The Wood Brothers on one of the tracks, Aaron Lipp & The Slack Tones are kicking the season off right. If you enjoy mind-bending guitar riffs over infectious old school rockabilly rhythms with original songwriting about today's times and troubles, you won't be disappointed!\n\nhttp://thehaunt.com", "start_time": "2017-12-01T20:00:00-0500", "priority": "0", "place": {"id": "124752354274305", "name": "The Haunt", "location": {"city": "Ithaca", "zip": "14850", "country": "United States", "longitude": -76.50517, "state": "NY", "street": "702 Willow Ave", "latitude": 42.45146}}, "id": "1524625594270144", "name": "Giant Panda Guerilla Dub Squad w/ The Slack Tones at The Haunt"}