{"description": "Friday December 1, Annie in the Water returns to Photo City Improv: Comedy & Music Venue in Rochester NY to perform with Seth Faergolzia's Multibird & Superty Dupes.  This night will also feature the culmination of Seth Faergolzia's Loop Paintings.  Ten paintings and videos will be on display throughout the night.\n\nDoors / Art Show are at 7pm\nMusic begins at 8pm\n18+\n$8\n\nAnnie in the Water: https://archive.org/details/AnnieInTheWaterLiveAtParadiseRockClub2017.11.11/2.ChangeMyMind.flac\n       Beginning as a duo years ago, the band has evolved into the five-piece powerhouse that it is today.  Members Brad Hester (lead vocals/acoustic guitar), Michael Lashomb (lead guitar/vocals), Josh West (drums/percussion/vocals), JD Tolstoi (keyboards/organ/vocals), and Billy Comstock (bass/vocals) have been taking the east coast by sonic-storm together since last April, with performances at StrangeCreek, Disc Jam, ADK Independence Music Festival and the Frendly Gathering (among others), and the momentum is increasing.   \n       The music is a groove-infused combination of rock, reggae, and funk, with a healthy dose of improvisation.  Five strong personalities, five-part harmonies and conscious lyrics are an integral part of the band’s original sound.  \n       The group is a band of friends focused on bringing positive vibes and raising the vibration of any room or stage they play, and their heartfelt performances bring smiles and get the booties shaking.  The fan base and family grows with each show, and no show is the same as the last.  Dedicated to building a platform that inspires growth, the band intends to evolve and raise consciousness while connecting the people of the world through music. \n\n\nSeth Faergolzia's Multibird:  www.faergolzia.com\n       Multibird, the new project by Seth Faergolzia (Dufus, Forest Creature, 23 Psaegz, Heck Yup) will be bringing the bounce to this unbridled house. Seth is well known for subtly harmonic, experimental lyricism, dynamic song structures, and whip-crack-acrobatic vocals. \n        With this solid four piece band behind him, you'll get a solid taste of improvised motion and totally danceable freak out.  Celebrated as a vibrant example of what happens when a musician turns a genre like folk upside down and inside out, over time Faergolzia has come to represent something of a genre unto himself oft times nowhere near the folk aesthetic.  \n\n\nSuperty Dupes:  https://supertydupes.bandcamp.com/releases", "start_time": "2017-12-01T20:00:00-0500", "priority": "9", "place": {"id": "768319583287478", "name": "Photo City Improv: Comedy & Music Venue", "location": {"city": "Rochester", "zip": "14609", "country": "United States", "longitude": -77.569275, "state": "NY", "street": "543 Atlantic Ave", "latitude": 43.156315}}, "end_time": "2017-12-02T02:00:00-0500", "id": "1702056423176650", "name": "Annie in the Water, Seth Faergolzia's Multibird & Superty Dupes"}