{"description": "DSP Shows Presents New Year's Eve with Driftwood and special guest Milkweed at The Haunt on 12/31, come ring in 2018 with us!\n\n8:00PM Doors\n9:00PM Show\n\nDriftwood\nwww.driftwoodtheband.com\nWhen most people think of upstate New York, they either imagine bucolic landscapes or working-class towns. As natives of Binghamton, the members of Driftwood hail from a working town, but play music rooted in the land, leaning alternately into folk, old-time, country, punk, and rock, depending on their personal moods and their songs' needs.\n\n\"It's sometimes tough to keep any sort of focus on style or sound when you have three different songwriters,\" guitarist Dan Forsyth concedes. \"But it also allows us to branch out and explore in ways other bands don't. Also, I think it's important, as a band, to ask ourselves 'Is this a good next step?' I think everyone is very excited to know that it is.\" Describing the Driftwood sound, banjo player Joe Kollar offers, \"I consider our sound to be more of an attitude and an approach - the result of all of our influences in a completely open musical forum where the only stipulation is to use bluegrass instruments and create it from the heart.\"\n\nThat's as close to being pinned down as Driftwood ever gets. Such has always been the case for artists blurring and blending genre lines in order to innovate. Yes, they wield old-time instruments, but they do so with a punk-rock ethos. \"I do not know much about punk music, but I do know that it gives me a feeling of tearing into something without inhibition,\" violinist Claire Byrne says, adding, \"Old-time music has the same feeling for me. The music was a release for people living extremely hard lives in harsh conditions. In this way, the two styles of music are very similar: It's digging in and making a statement. It's rocking out and feeling totally reborn through the song.\"\n\nDriftwood has been digging in and rocking out since their 2005 formation, playing an average of 150 shows a year. \"In the beginning, we hit the road constantly with an all-or-nothing attitude,\" Forsyth confides. \"We were doing it with a lot of passion, but had no thoughts about long-term sustainability. Life outside of the band was minimal. One thing that I think we started to notice was, when you're always in it, you have no perspective and you start to lose yourself in a weird way.\"\n\nAs such, gigging and traveling that much can't help but influence and inform the band, individually and collectively. In the past, they used the stage to work out arrangements of new songs. For City Lights, they used the studio. \"Keeping this kind of touring schedule, we have thought of recording albums as a sort of secondary thing and considered ourselves a 'live' band. We learn so much on the road and this kind of work has always felt productive,\" Forsyth explains. \"It wasn't until this last album that we took some time off to learn more about being in the studio. We wanted to take our time and record on our own terms.\"\n\nAccording to Byrne, their own terms included \"taking a step forward with the production and the arrangements.\" Kollar tacks \"learning\" on, for good measure, while Forsyth adds \"good songs and bigger arrangements, and sounds than we had not previously achieved.\"\n\nEven though they come from different directions, the three founding members - along with bassist Joey Arcuri - tend to end up at the same place. That unity, as well as the joy derived from playing together, can be heard throughout City Lights.\n\nAs further evidence of their compatibility, both Forsyth and Byrne tag \"Skin and Bone\" as the head of the album. It's a Kollar composition that he says \"came from a reflection I had of myself and life on the road, in general. It touches on trying to keep perspective, forging ahead, and embracing the future.\" Clearly, that's a state of mind they can all relate to.\n\nThe heart of the album, though, is a toss up with Forsyth choosing the romance of \"Too Afraid,\" Byrne picking the nostalgia of \"The Waves,\" and Kollar tapping the excitement of the title track. That disparity may be because, in their decade together, the musicians have all undergone monumental life changes. They have come into their own... together. Forsyth is now a husband and father; Byrne is now a recorded songwriter. \"Generally speaking, there's a maturity to us now,\" Kollar explains. \"We have a bit of experience doing what we do and the music reflects that point of view. The song subjects, our playing/singing abilities, our recording abilities, and our relationships have all matured.\"\n\nForsyth picks up the thread, \"We have all learned an unbelievable amount of patience and teamwork strategy. Our band is close: Everyone knows a lot about each other. We travel in very tight quarters constantly and are always up on what's happening in each others' lives. I think this has really enabled us to express ourselves, individually and as a group, but also to understand each other and others in so many ways.\"\n\nHaving joined Driftwood when she was 21, Byrne has spent her whole adult life in the band \"learning to play and sing in a group, learning the art of performance, and, of course, learning who I am and what my purpose(s) in life are. I think you can hear those changes from the first record to the last one.\" Because City Lights marks her songwriting debut, she feels like her personal growth is on full display. \"Rather than just listening to my harmonies and fiddle playing, you now have lyrics, as well. I think the songs I have on this record reflect a woman going through a great shift in her life, settling down a bit, and reflecting on the many different ways that affects me and my relationships with others.\"\n\nAs the sole woman of the band, Byrne puts a clearly different spin on things. \"Sometimes, instead of thinking about adding a feminine perspective, I actually spend time thinking about how to make myself fit in with the guys and, therefore, dumbing down my femininity a bit,\" she says. \"With my songwriting, though, there is no hiding it. I'm talking about things from a woman's perspective that many other women will be able to relate to easier than they would if a man was writing and singing about the same topics.\"\n\nOne topic the three songwriters all agree on is home. In their own ways, they each love and reflect their hard-scrabble hometown. \"Growing up in the Chenango Bridge/Binghamton area, I never really thought about it being an economically depressed town. To me, it was a perfect balance of rivers, woods, campfires, street signs, factories, and city lights,\" Kollar says, referencing the new album's title. \"Now, I know a little more about it being a post-industrial town, but still I see it as a diamond in the rough. I relate to the sort of underdog/uphill feel of the town.\"\n\nByrne adds, \"I think coming from a place such as Binghamton makes us very raw. We are a reflection of where we grew up. There isn't really anything fancy about us - we aren't the 'hippest' group out there, as far as fashion goes - but we are certainly very real. What you see is what you get.\"\n\nMilkweed\nhttps://www.milkweedtheband.com/home\n Milkweed is a band that was born on Main Street in the quiet post industrial city of Binghamton NY.  It is the collaboration of three artists - Joseph Alston, Jacqualine Colombo and Peter Lister.  Without committing to one genre Milkweed has pulled from many of the great aspects of American music and created their own brand of American song and story telling.  Whether it is blue grass guitar flat picking, Chicago blues harmonica, Irish ballads or Jersey shore folk songs, Milkweed weaves together the sounds that make up the rich tapestry of American music history. With their lyrics they set themselves apart from the norm, taking the simple stories of everyday people and telling them through the lens of dreams and what it means to be a human.  The root of the bands sound is in the use of three part harmony to impart a sense of importance and depth to their lyrics that brings the listener into their songs and feel invested in it.\n\nMilkweeds debut full length album, Dream of An American Family, was released in November of 2015.  It consists of thirteen original songs ranging from fingerpicking ballads, up tempo picking tunes, to a piedmont blues inspired song.  It was recorded by Don Sternecker at the great Mixolydian Studios and was crafted to be like the great folk albums of the past, predominantly live and in front of great microphones.  Songs from the album have received praise and radio play throughout the Northeast and East Coast and has gotten Milkweed onto larger theater and festival stages over the last year.  Upon the arrival of a new tour van the band has been on the road  prolifically, playing more then 160 shows a year.  With the advent of a new album close at hand, longer tours booked nationally and collaborations with other musicians, Milkweed shows no sign of slowing down.", "start_time": "2017-12-31T21:00:00-0500", "priority": "0", "place": {"id": "124752354274305", "name": "The Haunt", "location": {"city": "Ithaca", "zip": "14850", "country": "United States", "longitude": -76.50517, "state": "NY", "street": "702 Willow Ave", "latitude": 42.45146}}, "id": "177168159506846", "name": "New Year's Eve with Driftwood"}