{"description": "$15 Adv/ $20 Dos / Age 18 And Up\n\nAdditional Info:\nKing Yellowman has an incredible history in Reggae music. His upbringing at the Maxfield Home orphanage in Kingston and being albino in Jamaica were two obstacles the he overcame and went on to be (at one time) the biggest reggae artist since Bob Marley.After winning a talent contest at Tastee Patties in Kingston, Yellow went on to excite reggae crowds all over Jamaica and the rest of the world with his boastful and sometimes bodacious lyrics. His ability to ride rhythm and excite a crowd made Yellow an instant hit in Jamaica. He also began to work with the Ace Sound System in St. Thomas and drew big crowds at his dancehall performances. Later in his career, Yellow began to spread out and work for a number of different producers, sometimes releasing as many as five albums per year. This led to a recording contract with CBS Records. Yellowman recorded one album with them before he was diagnosed with jaw cancer and was given six months to live. This was in 1986. After surgery an extended leave of absence from the record industry, Yellowman began his comeback with the song \"Blueberry Hill\", and his career was re-launched. His first album for RAS came from producer Phillip 'Fatis' Burrell and was called \"Yellow Like Cheese\". Coincidentally this was the start of a long and fruitful relationship with RAS and Yellowman and also RAS and 'Fatis' and his exterminator production. Yellowman has always been very professional to work with and always a respectful and reliable human being. He has managed to outlive his predicted fate of death and his performances are incredibly lively as he seems to have an unlimited amount of stage energy. We can only hope for the best for Yellowman. He has continued his hard work and his devotion to his family is to be complimented.Root Shock: Root SHOCK was formed in Winter of 2012 with veteran musicians whose love of reggae music flows deep. Blending roots reggae, dancehall, heavy drum & bass and soulful vocals with conscious lyrics into positive dance music will make you want to move!Root Shock has been surprising and delighting crowds across the Central New York region, bringing their unique high-energy style spearheaded by the stunning vocals of Jessica Brown to a wide range of settings. The band's dedication to spreading music with a positive message has paid off in entertaining, elevating, and energizing music lovers of all walks of life!\nTickets:\nhttp://www.ticketweb.com/fb/7783065/funknwaffles", "start_time": "2017-11-21T20:00:00-0500", "priority": "9", "place": {"id": "86659589746", "name": "Funk 'n Waffles Rochester", "location": {"city": "Rochester", "zip": "14604", "country": "United States", "longitude": -77.61141, "state": "NY", "street": "204 N Water St", "latitude": 43.16048}}, "id": "1783146791983528", "name": "Yellowman & The Sagittarius Band w/s/g Root Shock"}