{"description": "$5 / Age 18 And Up\n\nAdditional Info:\n\n// Personal Blend: Personal Blend is a 7- piece reggae/ rock group out of Rochester, NY. Coming off their full length debut album 'Skin Deep' in August of 2016, the band has been making waves throughout Upstate NY playing both festivals and venues alike and continuing to push forward. They bring a feel-good, party-vibe that's including of all people and age groups and the band always leaves you wanting more. Personal Blend hopes to share their message of love and unity so be on the lookout for PB in a city near you.\n\n// Upward Groove: Upward Groove is a talented 8-piece band from Rochester, NY. The eclectic group was formed in 2012 as the brainchild of area musician and songwriter Eli Flynn. This energetic group of musicians has shared the stage with national acts including: Grammy Award winner Ms. Monet, Giant Panda Guerilla Dub Squad, Gang of Thieves, Yonder Mountain String Band, Preach Freedom, Moon Hooch and more!Blending a unique sound of rock, jazz, blues, and pop, the band has a little something for everyone. Drawing influence from Red Hot Chili Peppers, Sublime, Lettuce and The Strokes, the group has a well-developed sound with crafty lyrics and energy. With a powerful horn section, this group truly separates themselves from the average rock band. A must see, these guys will have you leaving a show with a catchy melody in your head. The band's full length album entitled \"Sweet Tooth For Sweet Tunes\" is available on iTunes and Spotify. Their latest EP \"Onward & Upward\" is also available as of April 2017\nTickets:\nhttp://www.ticketweb.com/event/-personal-blend-upward-groove-funk-n-waffles-music-hall-tickets/7852545?REFERRAL_ID=twfb", "start_time": "2017-12-28T20:30:00-0500", "priority": "9", "place": {"id": "86659589746", "name": "Funk 'n Waffles Rochester", "location": {"city": "Rochester", "zip": "14604", "country": "United States", "longitude": -77.61141, "state": "NY", "street": "204 N Water St", "latitude": 43.16048}}, "id": "1994657670791675", "name": "Personal Blend EP Release wsg/ Upward Groove, Joe Kaplan (Duo)"}