{"description": "Thursday December 14th - After Funk Holiday Throwdown w/ Root Shock\nDoors: 8:00pm, Show: 9:00pm - Tickets: $7 ADV/$10 DOS - Ages: 18+\n________________________________________________\n\nAfter Funk is a fun filled, soul driven, funk-rock explosion.\nHailed as “The grooviest band north of the border” (Live for Live Music), the Toronto based funk family have been blazing a trail through the North American music scene leaving only happy hearts and dancing feet in their wake. The combination of Yanick Allwood (keyboards & vocals), Jaime Rosenberg (drums), Justin Bontje (bass) and Phil Tessis (guitar) results in an infectiously fun show, as well as virtuosity and beauty that will challenge your musical mind.\n\nAfter Funk’s sound and hard work has not gone unnoticed; being selected as the Electric Forest’s Instrumental Forester in 2014 earned them two sets at the festival and they have served as support for Walk Off The Earth, Lettuce, Snarky Puppy, Dumpstaphunk, TAUK and more.\nThe band has released 2 albums to help you prepare for the experience: ‘Til The Sun Comes Up features Canadian hip hop legend Choclair and earned over $10,000 in crowdfunding presales and their self-titled debut EP was mixed and mastered by Alan Evans of Soulive. Both albums promise to have you rocking out and singing along to catchy melodies and funky grooves. But if you truly want to find out what comes after the funk, you’ll just have to come experience it for yourself.\nRoot Shock: Root SHOCK was formed in Winter of 2012 with veteran musicians whose love of reggae music flows deep. Blending roots reggae, dancehall, heavy drum & bass and soulful vocals with conscious lyrics into positive dance music will make you want to move! \n\nRoot Shock has been surprising and delighting crowds across the Central New York region, bringing their unique high-energy style spearheaded by the stunning vocals of Jessica Brown to a wide range of settings. The band’s dedication to spreading music with a positive message has paid off in entertaining, elevating, and energizing music lovers of all walks of life!", "start_time": "2017-12-14T21:00:00-0500", "priority": "9", "place": {"id": "326935087434191", "name": "Buffalo Iron Works", "location": {"city": "Buffalo", "zip": "14203", "country": "United States", "longitude": -78.874733, "state": "NY", "street": "49 Illinois St", "latitude": 42.874485}}, "end_time": "2017-12-15T00:00:00-0500", "id": "218036568735612", "name": "After Funk w/ Root Shock at Buffalo Iron Works - DEC 14TH"}