{"description": "Giant Panda Guerilla Dub Squad \nw/ Jah Works\nFriday, February 2nd 2018\nat The Ardmore Music Hall\n\n7:30pm Reserved Doors\n8pm GA Doors\n8:30pm Show \n$14 Advance / $17 Day of Show / $25 Reserved\n\nTickets on sale now: http://bit.ly/GiantPandaAMH\n\n**Giant Panda Guerilla Dub Squd** \nFormed in 2001 in Rochester, New York, GPGDS first received praise for their live show, which combined world beats and reggae rhythms within jamband aesthetics. In recent years the band’s studio recordings, which showcase their songwriting and musicianship across all genres of roots music, have further cemented their legend as master innovators and artists. “There is a lot of intention in this release. We had a purpose to prove to ourselves recording this album [MAKE IT BETTER]. We wanted to know that we could put our heads down and do good work fast. It was a great release artistically. It uniquely sounds the most progressive of anything we have ever done while also sounding the most like our first album.” -James Searl, Bassist/Vocalist\n\n**Jah Works**\nJah Works is a true grassroots success story that emerged from Baltimore’s reggae scene over 20 years ago. This is music made by and for lovers of real, authentic reggae music. Consistently performing hundreds of shows a year worldwide, they have forged their sound in clubs, festivals and on the sun drenched beaches of Negril. Their sound is firmly planted in the roots of Jamaican music and culture, encompassing rock steady, reggae, and elements of dancehall and dub. What Jah Works does best is introduce the novice music listener to the fullness of reggae music and culture.", "start_time": "2018-02-02T20:30:00-0500", "priority": "9", "place": {"id": "602638636422958", "name": "The Ardmore Music Hall", "location": {"city": "Ardmore", "zip": "19003", "country": "United States", "longitude": -75.290093, "state": "PA", "street": "23 E Lancaster Ave", "latitude": 40.007579}}, "end_time": "2018-02-02T23:59:00-0500", "id": "237200080147086", "name": "Giant Panda Guerilla Dub Squad w/ Jah Works at The Ardmore Music Hall 2/2"}