{"description": "$ 20.00 / Age All Ages\n\nAdditional Info:\nTICKETS AVAILABLE SOON AT THE BOP SHOP, LOVIN' CUP AND ONLINEBOP SHOP RECORDS presents:BILL KIRCHEN'S HONKY TONK HOLIDAY SHOWGrammy nominated guitarist, singer and songwriterBill Kirchenis one of the fortunate few who can step onto any stage, play those trademark licks that drove his seminal Commander Cody classic Hot Rod Lincoln into the Top Ten, and elicit instant recognition for a career that has spanned over 40 years and includes guitar work with Nick Lowe, Emmylou Harris, Doug Sahm, Elvis Costello and many more. Named \"A Titan of the Telecaster\" by Guitar Player Magazine, he celebrates an American musical tradition where rock 'n' roll and country music draws upon its origins in blues and bluegrass, Western swing from Texas andCalifornia honky-tonk.All you need to know about Bill -http://billkirchen.com/homeAll you need to see of Bill -http://billkirchen.com/videosPRESS QUOTESJohnny Cash- \"I think he's great.\"Nick Lowe- \"A devastating culmination of the elegant and the funky, a really sensational musician with enormous depth.\"Indy Week- \"one of the best guitarists in the land\"Vintage Guitar Magazine- \"an American treasure\"Washington City Paper- \"Like an impassioned preacher in a souped-up convertible, Kirchen described passing Muddy Waters, Link Wray, Merle Haggard, B. B. King, Carl Perkins, Jimi Hendrix and more, nodding in tribute to each one with a perfect guitar quotation as he drove by.  Bill Kirchen took every one for the ride of their lives in his Hot Rod Lincoln.\"Rolling Stone- \"Opening night was particularly special due to the presence of Les Paul and Albert Lee,  Bill Kirchen cranked up his Tele for a set that gave the crowd a hotfoot, sparked by his epic cover of ['Hot Rod Lincoln']. (review of Danny Gatton Tribute, New York, Tramps)\"DOORS @ 6:30PM | $20 ADVANCE/$25 DAY OF SHOWSHOW @ 8:00PM\nTickets:\nhttp://www.ticketweb.com/event/bill-kirchens-honky-tonk-holiday-lovin-cup-tickets/7804575?REFERRAL_ID=twfb", "start_time": "2017-12-07T20:00:00-0500", "priority": "9", "place": {"id": "143806965652986", "name": "Lovin' Cup", "location": {"city": "Rochester", "zip": "14623", "country": "United States", "longitude": -77.656892912435, "state": "NY", "street": "300 Park Point Drive", "latitude": 43.0917479}}, "id": "268365467018736", "name": "Bill Kirchen's Honky Tonk Holiday Show"}