{"description": "Big Mean Sound Machine \nwith Root Shock\nWaterhole Halloween 2017\nCostume Party \n\nWaterhole Upstairs Music Lounge\n48 Main St., Saranac Lake, NY \n8pm  Doors 9pm  Show\n$10.00 Advanced $12.00 Door\nwww.saranaclakewaterhole.com\n\nBig Mean Sound Machine - Ithaca, NY\nAfrobeat-Dance-Experimental-Funk\nhttps://www.bigmeansoundmachine.com/\n\nIn 2009, Big Mean Sound Machine formed in Ithaca, New York with one goal: to create music that stimulates both the Body AND Mind. The result has become a fiery exhibition of artfully conceived dance music that truly is Big and Mean. Today, BMSM comprises a collective of over 15 analog artists spread out over the Northeastern United States, who strive day in and day out to reanimate and reinterpret a fusion of Afrobeat, Funk, Jazz, Latin and many other styles, all through a postmodern lens. Anyone who has witnessed The Machine live in action knows that their performances are among the heaviest and the sweatiest. Anyone who has heard their studio releases also knows that they can refine this complex sonic force with maturity and clarity that allows each composition to blossom to its fullest. As of January 2013, their performative efforts have extended to the big screen as well. With the release of DR. IGUANA: LIVE IN THE STUDIO, a live DVD shot at Grammy Award-winning studio Electric Wilburland, Big Mean Sound Machine adds more critical acclaim to that received from their CD releases Marauders (2012), and Ouroboros (2011). In addition, in 2012 Big Mean released Warrior, a joint effort with vocalist Jay Spaker a.k.a. J-SAN (John Brown's Body, JATAS), and in 2013, the band released an album with Ghana's Yao Foli \"Cha Cha\" Augustine (Mosaic Foundation, The Ndor Band) supporting the Ndor Eco Village project in Foli's home village. Recently, BMSM digitally released the single \"In the Name of What?\" to promote their upcoming studio album \"Contraband\" which was tracked live and is due to be released May 31st, 2014 on vinyl, and CD (Angry Mom Records) as well as digitally. The band maintains a busy performance schedule, captivating cities throughout the Northeast United States and beyond, spreading further each week. And for those like-minded souls who are tired of the status quo, there is good news: BIG MEAN SOUND MACHINE HAS OFFICIALLY ARRIVED.\n\n\"Big Mean Sound Machine is in the enviable position of having established a sound that fits in almost anywhere—it’ll be interesting to see what they do with this considerable potential.\"\n\n- Afropop Worldwide\n\nBig Mean is all about making music for the body and mind. \nMixing elements and ideas from every corner of the globe, the band is determined to make you sweat. Artfully conceived dance music at its finest. \n\nRoot Shock - Syracuse, NY\nHigh Energy Roots Soul Reggae\nhttp://www.rootshockmusic.com/\n\nRoot SHOCK was formed in Winter of 2012 with veteran musicians whose love of reggae music flows deep. Blending roots reggae, dancehall, heavy drum & bass and soulful vocals with conscious lyrics into positive dance music will make you want to move! \n\nRoot Shock has been surprising and delighting crowds across the Central New York region, bringing their unique high-energy style spearheaded by the stunning vocals of Jessica Brown to a wide range of settings. The band’s dedication to spreading music with a positive message has paid off in entertaining, elevating, and energizing music lovers of all walks of life!", "start_time": "2017-10-27T21:00:00-0400", "priority": "0", "place": {"id": "39434788737", "name": "Waterhole", "location": {"city": "Saranac Lake", "zip": "12983", "country": "United States", "longitude": -74.13151, "state": "NY", "street": "48 Main St", "latitude": 44.32569}}, "end_time": "2017-10-28T02:30:00-0400", "id": "277857366034171", "name": "Big Mean Sound Machine wsg. Root Shock - Halloween Party"}