{"description": "DANKSGIVING. A Classic Funky Reggae Party. One Night Only.  Run for Cover.\n\nDoors at 8:30 PM\n\nDj 2-Way: 9:00 PM to 10:00 PM\nBead N' Bone: 10:00 PM to 11:15 PM\nDj 2-Way: 11:15 PM to 11:30 PM\nThe Medicinals: 11:30 PM to 1:00 AM\nDj 2-Way 1:00 AM to 2:00 AM\n\nAnd as always you can head over to our website and download our music for FREE!\n\nhttps://www.themedicinalsmusic.com/\n\nThe Medicinals have had a pretty fun 2017 thus far having opened up for such national acts as the Wailers (twice), and Turkuaz, as well as sharing the stage with the legendary Majestics, and regional favorites Root Shock, Noble Vibes, and the Crucial Reggae Social Club to name a few.  In addition we have also had the distinct pleasure of debuting at the Lilac Festival, Sterling Stage’s Ameribeat as well as the Genesee Park Point Concert Series.\n\nFor our next hometown show we are continuing this trend and adding onto this roster of inspirational friends in a very special way as we are very excited to announce that we will be bringing Kevin Kinsella (founder of John Brown's Body & 10 Foot Ganja Plant) with his new band \"Bead N’ Bone\" here to share the stage with us all night long. \n\nTo make the night truly complete we have also invited our great friend Dj 2-Way (Level 7 Experience) to be the house selector on decks for the entire night.\n\nHakeem Dodley will be the Medicinals FOH engineer for the entire set.\n\nThis show will be The Medicinals last hometown hit of 2017 before we get back into the studio to rehearse and record for 2018 so we truly hope you all can roll through with your respective crews and dance the night away with us.", "start_time": "2017-11-24T20:30:00-0500", "priority": "9", "place": {"id": "622059694538938", "name": "Flour City Station", "location": {"city": "Rochester", "zip": "14604", "country": "United States", "longitude": -77.59971, "state": "NY", "street": "170 East Ave", "latitude": 43.15669}}, "end_time": "2017-11-25T02:00:00-0500", "id": "297728537370262", "name": "TONIGHT - Danksgiving w/ The Medicinals, Kevin Kinsella, Dj 2-Way"}