{"description": "The Odd Ball - December 8th and 9th\nat The Waterhole Upstairs Music Lounge\nSaranac Lake, NY \n\nfeat Two Nights of The Blind Owl Band\nDec. 8th - The Mallett Brothers Band & TBA\nDec. 9th - Bella's Bartok and Tigerman Woah\n\n48 Main St. Saranac Lake, NY 12983\n8pm Doors 9pm Show\n$13.00 Adv Tickets - $15.00 Door \nLimited number of $20.00 Two Day Passes on Sale 10/25/17\n\nwww.saranaclakewaterhole.com\n\nThe Blind Owl Band, Saranac Lake, NY\n\"Freight Train String Music\"\nwww.theblindowlband.com\n\nHailing from Saranac Lake, NY, in the heart of the Adirondack mountains, The Blind Owl Band has been creating what they call Freight Train String Music since 2010. And a freight train it truly is. Although the quartet's sound is rooted in traditional stringed instruments (guitar, basses, banjo and mandolin), their music surges forward with the strength and power of a hundred-ton diesel locomotive. Songs barrel down the tracks with momentum and intensity normally found in much heavier, heavily amplified music. “Although we look like a bluegrass band we are not,\" explains co-founder Eric Munley (mandolin, vocals). \"Collectively, we're a musical representation of the sounds floating around in our heads. We use the instruments of our ancestors, but play music of our time; we're influenced much more by all that has happened in the musical world over the past three decades than by what was created in the first three-quarters of the 20th Century.\" The Blind Owl Band builds on what they regard as a basic approach to traditional songwriting and arranging and push the envelope, stretching the limits of raw, acoustic instrumentation. Munley explains part of the band's mindset: \"In a time of perfection and an increasing reliance on digital processors, we're trying to expand the sound, to inspire use of wood and metal.\" In just under five years the band has released two albums (Rabble Rousing and This Train We Ride is Made of Wood and Steel) and toured extensively throughout the eastern US, logging nearly 600 show across 17 states since January 2012. They've played on almost every festival east of the Mississippi and shared the stage with countless artists across all genres of the musical spectrum. Looking ahead into 2017, the band will begin recording their as-yet-untitled third full length album in early summer, with an eye toward a October 13th, 2017 release. This freight train has no one conductor but four shovel boys pushing the limits of their engine night after night, so climb aboard and get ready for a one-of-a-kind ride.\n\nThe Mallett Brothers Band - Portland, Maine \nhttp://www.mallettbrothersband.com/\n\n\"The Mallett Brothers Band packed their first four albums chock-full of crackling Americana, a foot-stomping patchwork of country, folk, and rock. But the usually rowdy sextet hits quieter notes on their latest album, The Falling of the Pine, a ruminative collection of 19th-century lumber-camp songs lent new melodies and arrangements. Across 10 tracks of rich instrumentation and absorbing harmonies, the Portland-based Malletts revitalize bygone tales of the triumphs and yearnings of working Mainers. For state history buffs — or for fans of the Avett Brothers, Okkervil River, or even Springsteen — the Malletts’ record deserves a serious listen.\" - Down East Magazine\n\nFormed in 2009 in Portland, Maine, The Mallett Brothers Band is an independent, nationally touring country rock and roll band consisting of brothers Luke and Will Mallett (vocals, guitar), Nick Leen (bass guitar), Wally (dobro, vocals, guitar), Andrew Martelle (fiddle, mandolin), and Chuck Gagne (drums). Tour dates at mallettbrothersband.com", "start_time": "2017-12-08T21:00:00-0500", "priority": "9", "place": {"id": "39434788737", "name": "Waterhole", "location": {"city": "Saranac Lake", "zip": "12983", "country": "United States", "longitude": -74.13151, "state": "NY", "street": "48 Main St", "latitude": 44.32569}}, "end_time": "2017-12-09T02:00:00-0500", "id": "307590013058936", "name": "The Odd Ball FRI - Blind Owl Band - Mallett Brothers Band"}