{"description": "DSP Shows Presents John Brown's Body with very special guests THUNDER BODY at The Haunt on 12/29!!\n\n8:00PM Doors\n9:00PM Show\n\nJohn Brown's Body\nwww.johnbrownsbody.com\nTogether for two decades and hailed as “Future roots, reggae, and dub with an intricately balanced weaving of vocals, percussion, keyboard, bass, guitar, and stunning 3-piece horn section that ties it all together” (WRUV), John Brown’s Body (JBB) is building “a legacy that has inspired and carved a path for the now thriving contemporary American reggae scene” (Rudeboy Reggae). Formed in Ithaca, New York, in the mid 1990s, at a time when there wasn’t yet a far-reaching U.S. reggae scene, JBB was one of a small handful of U.S. reggae bands that began touring nationally. Since then, JBB has played an important role in helping define distinctly “American reggae.” JBB’s music is steeped in traditional vibes, but unapologetically incorporates elements from other genres. While most American reggae bands tackled typical reggae themes (such as religion and marijuana), JBB acted more like an indie band, writing songs that used the vocabulary of reggae to express their own experiences. Their unique approach resonated with the masses. The group’s 2008 full-length record, Amplify, hit #1 on the Billboard Reggae Chart, 2012’s JBB In Dub EP reached #1 on iTunes’ Reggae Chart, and in 2013 Kings And Queens topped both Billboard and iTunes Reggae Charts at #1. Today, JBB’s signature style has become the norm for U.S. reggae bands - and many in the genre admittedly point to John Brown’s Body as a key influence.", "start_time": "2017-12-29T20:00:00-0500", "priority": "0", "place": {"id": "124752354274305", "name": "The Haunt", "location": {"city": "Ithaca", "zip": "14850", "country": "United States", "longitude": -76.50517, "state": "NY", "street": "702 Willow Ave", "latitude": 42.45146}}, "id": "314398735693577", "name": "John Brown's Body"}