{"description": "$10 / Age 18 And Up\n\nAdditional Info:\nPearly Baker's Best is a Grateful Dead tribute with both a weekly residency and a devoted following at one of the top local venues in Syracuse, NY every Monday night. Playing the music of The Grateful Dead, The Jerry Garcia Band, The Beatles and other covers they delight their devout followers with a powerful show once a week out of the band's current song list which tops 180 songs. The band's strong improvisational foundation leads the way, allowing their sets to be visualized much like weaving a tapestry; each thread of verse, chorus or bridge is expertly weaved into the fabric of their sound and playing to be completely embraced by their audience. Also, careful attention is always given to ensuring that each song is treated with the necessary vocal ingredients to cause the listener to be drawn into the music at the deepest level. The band's desire is to provide each audience member with a 'Grateful Dead-like experience,' allowing them to encounter the show as a translational, musical undertaking. Currently PBB can go 9 shows without repeating a song and is always adding to it's ever expanding catalog of 200 songs which includes original songs on occasion. The band does play shows in addition to their weekly residency in Syracuse, all across New York State. The band has begun to incorporate original music into their sets and recently had the privilege of sharing their stage with David Gans; long-time archivist for the Grateful Dead, broadcaster, song writer and music journalist. David expressed a strong desire to share the stage with Pearly Baker's again in the near future. There is truly nothing like a Pearly Baker's Best show.\nTickets:\nhttp://www.ticketweb.com/event/pearly-bakers-best-funk-n-waffles-music-hall-tickets/7852395?REFERRAL_ID=twfb", "start_time": "2017-12-23T21:30:00-0500", "priority": "9", "place": {"id": "86659589746", "name": "Funk 'n Waffles Rochester", "location": {"city": "Rochester", "zip": "14604", "country": "United States", "longitude": -77.61141, "state": "NY", "street": "204 N Water St", "latitude": 43.16048}}, "id": "520954601618390", "name": "Pearly Baker's Best"}