{"description": "Dirty Blanket returns to The Station.  James Searl and Dylan Savage from Giant Panda Guerilla Dub Squad will be sitting in during the set.  Please check back for more details.\n\nThe seeds of Dirty Blanket were planted in 2013 at the meeting of lead guitarist Max \"Dirty\" Flansburg and lead singer/songwriter Kevin \"Blanket\" O'Leary. Combining an array of unique musical influences with a shared passion for creating new original music, the two began playing as an acoustic duo. Utilizing what free time their other musical projects allowed to book gigs across Upstate NY, they eventually found themselves opening for acts as large as Jeff Austin of the Yonder Mountain String Band and beyond. The summer of 2016 saw the duo's sound take a shift toward a more heavily bluegrass-influenced style, with Max and Kevin crafting new originals and taking to the stage to cover the music of such Americana legends as Hot Rize, Newgrass Revival, the Del McCoury Band, and the like.\nIn the months that followed, the two were joined by longtime friends Richie Colf on the mandolin, and Joel Fedkiw on the five string banjo. By December of 2016, local Finger Lakes musician Aaron Oldweiler had joined the ranks on upright bass, rounding out the band as a 5-piece, fast-picking bluegrass quintet. The group continues to garner the attention of folk music lovers and festival goers from the Finger Lakes Region and across Upstate NY.\n\n21+\n\n$5 in advance -or- with a ticket stub for Yonder Mountain String Band or Railroad Earth and Giant Panda\n\n$10 otherwise", "start_time": "2017-11-04T22:30:00-0400", "priority": "0", "place": {"id": "622059694538938", "name": "Flour City Station", "location": {"city": "Rochester", "zip": "14604", "country": "United States", "longitude": -77.59971, "state": "NY", "street": "170 East Ave", "latitude": 43.15669}}, "end_time": "2017-11-05T01:00:00-0400", "id": "759610650906172", "name": "Dirty Panda After Party w/Dirty Blanket & members of Giant Panda"}